print('Фрагмент А')
print('Тип значения до испралвления: str, ожидаемый результат: 23')
print('Тип значения после исправления: int, ожидаемый результат: 5')
print('Ошибка: при складывании строк они просто склеяться, вместо подсчета')
first = 2
second = 3
print(first + second)

print('Фрагмент Б')
print('Тип значения до испралвления: str, ожидаемый результат: ошибка')
print('Тип значения после исправления: int, ожидаемый результат: 18')
print('Ошибка: строки не могут складываться с числами')
age = int(input("Возраст: "))
print(age + 1)

print('Фрагмент В')
print('Ошибка: сначала выполняется умножение и деление, а после сложение и вычитание')
print('Чтобы посчитать среднее, нужно сумму поместить в скобки')
first = 4
second = 7
third = 10
average = (first + second + third) / 3
print(average)
