famil = input('Введите свою фамилию:')
ima = input('Введите свое имя:')
gruppa = input('Введите свою группу:')
gorod = input('Введите свой город:')
vozrast = int(input('Введите свой возраст:'))
predmet = input('Введите свой любимый предмет:')
chasi = float(input('Введите кол-во часов подготовки в неделю:'))
print('Студенческий билет:')
print(ima, famil)
if vozrast in range(1, 121):
    print(f'Ваш возраст через 4 года: {vozrast + 4}')
else:
    print('Вы написали не свой настоящий возраст (долгоживущие расы не признаем!)')
if chasi >= 0:
    print(f'Ваше время подготовки за 4 недели: {(chasi*4):.2f}')
    print(f'Среднее время подготовки в день: {(chasi/7):.2f}')
else:
    print('Каким бы ты ленивым не был, отрицательное время готовиться не можешь!')
